class Solution:
    def isSubsequence(self, s: str, t: str) -> bool:
        #Двигаемся по обоим строкам. Если символы совпали, двигаем оба указателя. Если нет, то только во второй строке. 
        # Если мы смогли дойти до конца 1 строки, значит она вся попала внутрь второй и это верно
        i = 0
        j = 0
        while i < len(s) and j < len(t):
            if s[i] == t[j]:
                i += 1
                j += 1

            else:
                j += 1
        return (i == len(s))
