class Solution:
    def minimumTime(self, n: int, x: int, y: int) -> int:
        # Сначала ждем когда быстрый принтер напечатает одну копию, чтобы работали оба

        if n == 1:
            return min(x, y)

        l = 0
        r = (n - 1) * max(x, y)
    
        while l + 1 < r:
            mid = (l + r) // 2
    
            # Проверяем, успеют ли оба ксерокса сделать n-1 копий за mid минут
            if mid // x + mid // y < n - 1: # Проверяем достаточно ли этого времени. 
                l = mid 
            else:
                r = mid  
    
        return r + min(x, y) 
    

    # O(log(n)) по времени: диапазон поиска сокращается вдвое.
    # O(1) по памяти: используем фиксированное число переменных.
            
