class Solution:
    def findContentChildren(self, g: list[int], s: list[int]) -> int:
        g.sort() # Животные
        s.sort() #Еда
        #Решаю аналогичную задачу на литкоде. Для простоты оставляю те же имена массивов
        count = 0
        for f in s:
            if count < len(g) and g[count] <= f:
                count += 1
        return count

    # Сортируем животных и порции по возрастанию.
    # Каждому животному даём минимальную подходящую порцию.
    # Это оптимально, так как большие порции сохраняются для более требовательных животных.
