class Solution:
    def findTheDifference(self, s: str, t: str) -> str:
        # Сначала заполняем хэш таблицу, потом идем по второй строке и вынимаем оттуда элементы. Когда не можем достать элемент, значит мы нашли искомый символ
        # Так как добавиление и извлечение происходят за О(1), то общая сложность алгоритма О(n)
        a = {}
        for ch in s:
            a[ch] = a.get(ch, 0) + 1

        for ch in t:
            if a.get(ch, 0) == 0:
                return ch
            a[ch] -= 1
